#int() function
int(10.20)-->10
int(10+20j)--->TypeError
int(True)--->1
int(False)---->0
int("10")---->10
int("10.5")----ValueError
#----------------------------
#float():
float(10)---->10.0
float(10+5j)---->TypeError
float(Type)---->1.0
float("10")--->10.0
float("10.5")--->10.5
float("ten")---->
float("0B1111")--->
----------------------------
complex()
----------------------------
other types to complex type
complex(x)
complex(x,y)
--------------
bool()
bool(0)---->True
bool(10)---->False